const text  =  {
    1: `
    بیماری های دستگاه تنفسی : 
    ندارد


    بیماری های قلب و عروق : 
    ندارد


    بیماری های خونی : 
    ندارد


    بیماری های گوارشی : 
    ندارد


    بیماریهای اعصاب و روان : 
    ندارد


    بیماریهای اعصاب : 
    ندارد


    بیماریهای کلیه و مجاري ادرار : 
    ندارد


    بیماریهای استخوان و مفاصل : 
    ندارد


    بیماریهای پوستی : 
    ندارد


    بیماریهای گوش و حلق و بینی و چشم : 
    ندارد


    بیماریهای غدد داخلی : 
    ندارد


    سابقه بیماریهای عفونی : 
    ندارد


    بیماریهای دهان و دندان : 
    ندارد


    سابقه تومور یا کانسر (سرطان) : 
    خیر


    سابقه پیوند اعضاء بدن : 
    خیر


    آیا سابقه بستری در بیمارستان یا آسایشگاه را دارید؟ : 
    خیر


    آیا در 5 سال گذشته به پزشک متخصص مراجعه کرده اید؟ : 
    خیر


    آیا مورد عمل جراحی قرار گرفته اید؟ : 
    خیر


    آیا دچار نقص عضو شده اید؟ : 
    خیر


    آیا دچار از کار افتادگی شده اید؟ : 
    خیر


    آیا از سیگار استفاده میکنید؟ : 
    خیر


    آیا از دارویی برای بیماری ای به مدت طولانی استفاده می کنید؟ : 
    خیر


    آیا کسی از بستگان درجه اول شما به بیماری سل، سرطان، بیماری قلبی، فشار خـون، مرض قند، نارسایی کلیه، سکتـه مغزي، بیماري مـادرزادي یا بیماري روحی و عصبی مبتلا بوده یا میباشند؟ : 
    خیر


    آیا شما به بیماری یا عارضه دیگری مبتلا هستید ؟ : 
    خیر


    نیاز به هرگونه عمل جراحی تشخیص داده شده توسط پزشک در یک سال آینده دارید؟ : 
    خیر


    نیاز به هرگونه درمان خاص که در حال حاضر پزشک تشخیص داده است؟ : 
    خیر


    آیا ورزش حرفه اي انجام میدهید؟ : 
    خیر


    آیا شما در شش ماه گذشته کاهش وزن داشته اید ؟ : 
    خیر


    به غیر از موارد مذکور در این پرسشنامه، آیا سابقه ابتلا به هرگونه بیماری دیگری را داشته اید؟ : 
    خیر

    `,
    2: `
    آیا تا کنون بیمه نامه درمان تکمیلی نزد شرکت های بیمه گر داشته اید ؟ ( از تاریخ انقضا آن بیش از یک ماه نگذشته باشد ) : 
بله


آیا در یکسال اخیر به منظور صدور بیمه نامه زندگی ( عمر و سرمایه گذاری ) نسبت به انجام معاینات و آزمایشات پزشکی اقدام نموده اید ؟ : 
خیر


آیا مورد تایید پزشک بیمه قرار گرفته اید ؟ : 
خیر


    `
} 


export default text