import React, { useReducer } from "react";
import Trans_saleReducer from "./Trans_saleReducer";

export const Trans_saleContext = React.createContext();

const Tran_saleState = ({ children }) => {
  const insurances = [
    {
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "پریا دهقان",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "بیمه عمر",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9573456789",
      "نهایی شده": "بله",
    },
    {
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "شقایق دهقان",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "بیمه مسئولیت",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9572345678",
      "نهایی شده": "بله",
    },
    {
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "اکبر نبوی",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "بیمه مسئولیت",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "95710123456",
      "نهایی شده": "بله",
    },
    {
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "حسن نبوی",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "بیمه درمان",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9571234567",
      "نهایی شده": "بله",
    },
    {
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "مهدی مجیدی",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "بیمه درمان",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9570254000",
      "نهایی شده": "بله",
    },
    {
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "نیلوفر یزدانی",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "بیمه عمر",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9570000000",
      "نهایی شده": "بله",
    },
  
  ]

  const initialState = {
    insurances: insurances,
    insurance_name: "همه",
    search_name: "",
    insurance_show : false,
    insurance : '',
    number: '',
    insurance_show : false,    
    FromTime: '',
    ToTime: '',
  };


  const [state, dispatch] = useReducer(Trans_saleReducer, initialState);

  return (
    <Trans_saleContext.Provider
      value={{
        ...state,
        dispatch,
      }}
    >
      {children}
    </Trans_saleContext.Provider>
  );
};

export default Tran_saleState;
