import React, { useReducer } from "react";
import TransactionsReducer from "./TransactionsReducer";

export const TransactionContext = React.createContext();

const TransactionState = ({ children }) => {
  const insurances = [
    {
      محصول: "بیمه عمر",
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "تست",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "تست",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9570000000",
      "نهایی شده": "بله",
    },
    {
      محصول: "بیمه مسئولیت",
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "تست",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "تست",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9570000000",
      "نهایی شده": "بله",
    },
    {
      محصول: "بیمه مسئولیت",
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "تست",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "تست",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9570000000",
      "نهایی شده": "بله",
    },
    {
      محصول: "بیمه درمان",
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "تست",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "تست",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9570000000",
      "نهایی شده": "بله",
    },
    {
      محصول: "بیمه درمان",
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "تست",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "تست",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9570000000",
      "نهایی شده": "بله",
    },
    {
      محصول: "بیمه درمان",
      'شماره بیمه نامه':'تست',
      ذینفع: "تست",
      "بیمه گذار": "تست",
      "تاریخ ایجاد": "1400/08/05",
      'رشته بیمه': "تست",
      'شرکت بیمه': "تست",
      'حق بیمه': "تست",
      'درآمد': "تست",
      "شماره تماس ذینفع": "9570000000",
      "نهایی شده": "بله",
    },
  
  ]

  const initialState = {
    insurances: insurances,
    insurance_name: "همه",
    search_name: "",
    insurance_show : false,
    insurance : '',
    number: '',
    insurance_show : false,    
    FromTime: '',
    ToTime: '',
  };


  const [state, dispatch] = useReducer(TransactionsReducer, initialState);

  return (
    <TransactionContext.Provider
      value={{
        ...state,
        dispatch,
      }}
    >
      {children}
    </TransactionContext.Provider>
  );
};

export default TransactionState;
