import React, { useReducer } from "react";
import SaleReducer from "./SaleReducer";

export const SaleContext = React.createContext();

const SaleState = ({ children }) => {
  const insurances = [
    {
      محصول: "بیمه عمر",
      وضعیت: "استعلام",
      بازاریاب: "پریا دهقان",
      "بیمه گذار": "شقایق دهقان",
      "شماره تماس": 9121223456,
      "شیوه پرداخت": "نقدی",
      "حق بیمه": 100000,
      "تاریخ ایجاد": "1400/08/05",
      status_id: 100,
      "#": "جزییات",
    },
    {
      محصول: "بیمه درمان",
      وضعیت: "پرداخت شده",
      بازاریاب: "محسن دهقان",
      "بیمه گذار": "پریا دهقان",
      "شماره تماس": 9121111111,
      "شیوه پرداخت": "نقدی",
      " حق بیمه": 200000,
      "تاریخ ایجاد": "1400/08/06",
      status_id: 105,
      "#": "جزییات",
    },
    {
      محصول: "بیمه درمان",
      وضعیت: "انتظار پرداخت",
      بازاریاب: "حسن نبوی1",
      "بیمه گذار": "اکبر نبوی",
      "شماره تماس": 9122222222,
      "شیوه پرداخت": "اقساطی",
      " حق بیمه": 300000,
      "تاریخ ایجاد": "1400/08/07",
      status_id: 120,
      "#": "جزییات",
    },
    {
      محصول: "بیمه درمان",
      وضعیت: "انتظار تکمیل اطلاعات",
      بازاریاب: "حسن نبوی2",
      "بیمه گذار": "اکبر نبوی",
      "شماره تماس": 9122222222,
      "شیوه پرداخت": "اقساطی",
      " حق بیمه": 300000,
      "تاریخ ایجاد": "1400/08/07",
      status_id: 120,
      "#": "جزییات",
    },
    {
      محصول: "بیمه درمان",
      وضعیت: "بررسی کارشناس",
      بازاریاب: "حسن نبوی3",
      "بیمه گذار": "اکبر نبوی",
      "شماره تماس": 9122222222,
      "شیوه پرداخت": "اقساطی",
      " حق بیمه": 300000,
      "تاریخ ایجاد": "1400/08/07",
      status_id: 120,
      "#": "جزییات",
    },
    {
      محصول: "بیمه درمان",
      وضعیت: "صادر شد",
      بازاریاب: "حسن نبوی4",
      "بیمه گذار": "اکبر نبوی",
      "شماره تماس": 9122222222,
      "شیوه پرداخت": "اقساطی",
      " حق بیمه": 300000,
      "تاریخ ایجاد": "1400/08/07",
      status_id: 120,
      "#": "جزییات",
    },
    {
      محصول: "بیمه مسئولیت",
      وضعیت: "انتظار تکمیل اطلاعات",
      بازاریاب: "مهدی مجیدی",
      "بیمه گذار": "محمد مجیدی",
      "شماره تماس": 9123333333,
      "شیوه پرداخت": "...",
      " حق بیمه": 400000,
      "تاریخ ایجاد": "1400/08/08",
      status_id: 130,
      "#": "جزییات",
    },
    {
      محصول: "بیمه مسئولیت",
      وضعیت: "بررسی کارشناس",
      بازاریاب: "نیلوفر یزدانی",
      "بیمه گذار": "رضا یزدانی",
      "شماره تماس": 9124444444,
      "شیوه پرداخت": "...",
      " حق بیمه": 500000,
      "تاریخ ایجاد": "1400/08/09",
      status_id: 140,
      "#": "جزییات",
    },
    {
      محصول: "بیمه مسئولیت",
      وضعیت: "بررسی کارشناس",
      بازاریاب: "نیلوفر یزدانی",
      "بیمه گذار": "رضا یزدانی",
      "شماره تماس": 9124444444,
      "شیوه پرداخت": "...",
      " حق بیمه": 500000,
      "تاریخ ایجاد": "1400/08/09",
      status_id: 140,
      "#": "جزییات",
    },
    {
      محصول: "بیمه عمر",
      وضعیت: "سفارش اولیه",
      بازاریاب: "نیلوفر یزدانی",
      "بیمه گذار": "رضا یزدانی",
      "شماره تماس": 9124444444,
      "شیوه پرداخت": "نقدی",
      " حق بیمه": 500000,
      "تاریخ ایجاد": "1400/08/09",
      status_id: 140,
      "#": "جزییات",
    },
    {
      محصول: "بیمه درمان",
      وضعیت: "انتظار صدور",
      بازاریاب: "نیلوفر یزدانی",
      "بیمه گذار": "رضا یزدانی",
      "شماره تماس": 9124444444,
      "شیوه پرداخت": "نقدی",
      " حق بیمه": 500000,
      "تاریخ ایجاد": "1400/08/09",
      status_id: 140,
      "#": "جزییات",
    },
  ];


  const payments = [
    {
      سررسید : '1400/03/09',
      id: '0',
      مبلغ:'6000000',
      وضعیت: 'پرداخت نشده',
      'تاریخ پیوست' : '',
      'فایل پیوست پرداخت': 'ندارد'
    },
    {
      سررسید : '1400/06/10',
      id: '1',
      مبلغ:'6000000',
      وضعیت: 'پرداخت نشده',
      'تاریخ پیوست' : '',
      'فایل پیوست پرداخت': 'ندارد'
    },
    {
      سررسید : '1400/09/09',
      id: '2',
      مبلغ:'6000000',
      وضعیت: 'پرداخت نشده',
      'تاریخ پیوست' : '',
      'فایل پیوست پرداخت': 'ندارد'
    },
    {
      سررسید : '1400/12/09',
      id: '3',
      مبلغ:'6000000',
      وضعیت: 'پرداخت نشده',
      'تاریخ پیوست' : '',
      'فایل پیوست پرداخت': 'ندارد'
    }
  ]


  const treatment_people = [
    {
      نام: 'پریا دهقان',
      نام_پدر : 'تست',
      نسبت  : 'بیمه گذار',
      درصد_فرانشیز:'تست',
      تاریخ_تولد:'تست',
      جنسیت:'تست',
      بیمه_گر_پایه:'تست',
      بیمه_زندگی:'تست'
    },
    {
      نام: 'پرستو دهقان',
      نام_پدر : 'تست',
      نسبت  : 'خواهر',
      درصد_فرانشیز:'تست',
      تاریخ_تولد:'تست',
      جنسیت:'تست',
      بیمه_گر_پایه:'تست',
      بیمه_زندگی:'تست'
    },
    {
      نام: 'پرستو دهقان',
      نام_پدر : 'تست',
      نسبت  : 'خواهر',
      درصد_فرانشیز:'تست',
      تاریخ_تولد:'تست',
      جنسیت:'تست',
      بیمه_گر_پایه:'تست',
      بیمه_زندگی:'تست'
    },
  ]

  const initialState = {
    insurances: insurances,
    insurance_name: "همه",
    insurance_status: "همه",
    search_name: "",
    insurance : '',
    statuses: '',
    status: '',
    number: '',
    insurance_show : false,    
    status_show : false,
    FromTime: '',
    ToTime: '',
    showEdit: false,
    showPayment: false,
    showPaymentTable: false,
    payments: payments,
    payment_date:{ day: '', month: '', year: ''},
    treatment_people: treatment_people,
    insurer_treatment: false,
  };
  const [state, dispatch] = useReducer(SaleReducer, initialState);

  return (
    <SaleContext.Provider
      value={{
        ...state,
        dispatch,
      }}
    >
      {children}
    </SaleContext.Provider>
  );
};

export default SaleState;
