import React, { useReducer } from "react";
import CategoryReducer from "admin/category/state/Reducer";

export const CategoryContext = React.createContext();

const CategoryState = ({ children }) => {
  const categories = [
    {
      id: 1,
      seo: {
        title: "بیمه-توکو سامانه فروش آنلاین بیمه",
        name: "insurance",
        description:
          "سازوکاری است که طی آن یک بیمه‌گر، بنا به ملاحظاتی تعهد می‌کند که زیان احتمالی یک بیمه‌گذار را در صورت وقوع یک حادثه در یک دوره زمانی خاص، جبران نماید یا خدمات مشخصی را به وی ارائه دهد؛ بنابراین، بیمه یکی از روش‌های مقابله با ریسک است.[۱]  طی یک قرارداد بیمه، ریسک مشخصی از یک طرف قرارداد (که بیمه گذا",
      },
      title: "بیمه",
      description:
        "بيمه پيمانی است که بر پايه‌ آن شرکت بيمه (بيمه‌گر) تعهد می‌کند در برابر مقدار پولی که فرد يا شرکت ديگری (بيمه‌گذار) به او پرداخت می‌کند، زيان وارد شده به بيمه‌گذار را در پی رويدادی ناخواسته جبران کند. پولی را که بيمه‌گذار به بيمه‌گر می‌پردازد، حق بيمه و آنچه را که بيمه می‌شود، موضوع بيمه می‌نامند.",
    },
    {
      id: 2,
      seo: {
        title: "بیمه-توکو سامانه فروش آنلاین بیمه",
        name: "insurance",
        description:
          "سازوکاری است که طی آن یک بیمه‌گر، بنا به ملاحظاتی تعهد می‌کند که زیان احتمالی یک بیمه‌گذار را در صورت وقوع یک حادثه در یک دوره زمانی خاص، جبران نماید یا خدمات مشخصی را به وی ارائه دهد؛ بنابراین، بیمه یکی از روش‌های مقابله با ریسک است.[۱]  طی یک قرارداد بیمه، ریسک مشخصی از یک طرف قرارداد (که بیمه گذا",
      },
      title: "بیمه",
      description:
        "بيمه پيمانی است که بر پايه‌ آن شرکت بيمه (بيمه‌گر) تعهد می‌کند در برابر مقدار پولی که فرد يا شرکت ديگری (بيمه‌گذار) به او پرداخت می‌کند، زيان وارد شده به بيمه‌گذار را در پی رويدادی ناخواسته جبران کند. پولی را که بيمه‌گذار به بيمه‌گر می‌پردازد، حق بيمه و آنچه را که بيمه می‌شود، موضوع بيمه می‌نامند.",
    },
    {
      id: 3,
      seo: {
        title: "بیمه-توکو سامانه فروش آنلاین بیمه",
        name: "insurance",
        description:
          "سازوکاری است که طی آن یک بیمه‌گر، بنا به ملاحظاتی تعهد می‌کند که زیان احتمالی یک بیمه‌گذار را در صورت وقوع یک حادثه در یک دوره زمانی خاص، جبران نماید یا خدمات مشخصی را به وی ارائه دهد؛ بنابراین، بیمه یکی از روش‌های مقابله با ریسک است.[۱]  طی یک قرارداد بیمه، ریسک مشخصی از یک طرف قرارداد (که بیمه گذا",
      },
      title: "بیمه",
      description:
        "بيمه پيمانی است که بر پايه‌ آن شرکت بيمه (بيمه‌گر) تعهد می‌کند در برابر مقدار پولی که فرد يا شرکت ديگری (بيمه‌گذار) به او پرداخت می‌کند، زيان وارد شده به بيمه‌گذار را در پی رويدادی ناخواسته جبران کند. پولی را که بيمه‌گذار به بيمه‌گر می‌پردازد، حق بيمه و آنچه را که بيمه می‌شود، موضوع بيمه می‌نامند.",
    },
    {
      id: 4,
      seo: {
        title: "بیمه-توکو سامانه فروش آنلاین بیمه",
        name: "insurance",
        description:
          "سازوکاری است که طی آن یک بیمه‌گر، بنا به ملاحظاتی تعهد می‌کند که زیان احتمالی یک بیمه‌گذار را در صورت وقوع یک حادثه در یک دوره زمانی خاص، جبران نماید یا خدمات مشخصی را به وی ارائه دهد؛ بنابراین، بیمه یکی از روش‌های مقابله با ریسک است.[۱]  طی یک قرارداد بیمه، ریسک مشخصی از یک طرف قرارداد (که بیمه گذا",
      },
      title: "بیمه",
      description:
        "بيمه پيمانی است که بر پايه‌ آن شرکت بيمه (بيمه‌گر) تعهد می‌کند در برابر مقدار پولی که فرد يا شرکت ديگری (بيمه‌گذار) به او پرداخت می‌کند، زيان وارد شده به بيمه‌گذار را در پی رويدادی ناخواسته جبران کند. پولی را که بيمه‌گذار به بيمه‌گر می‌پردازد، حق بيمه و آنچه را که بيمه می‌شود، موضوع بيمه می‌نامند.",
    },
    {
      id: 5,
      seo: {
        title: "بیمه-توکو سامانه فروش آنلاین بیمه",
        name: "insurance",
        description:
          "سازوکاری است که طی آن یک بیمه‌گر، بنا به ملاحظاتی تعهد می‌کند که زیان احتمالی یک بیمه‌گذار را در صورت وقوع یک حادثه در یک دوره زمانی خاص، جبران نماید یا خدمات مشخصی را به وی ارائه دهد؛ بنابراین، بیمه یکی از روش‌های مقابله با ریسک است.[۱]  طی یک قرارداد بیمه، ریسک مشخصی از یک طرف قرارداد (که بیمه گذا",
      },
      title: "بیمه",
      description:
        "بيمه پيمانی است که بر پايه‌ آن شرکت بيمه (بيمه‌گر) تعهد می‌کند در برابر مقدار پولی که فرد يا شرکت ديگری (بيمه‌گذار) به او پرداخت می‌کند، زيان وارد شده به بيمه‌گذار را در پی رويدادی ناخواسته جبران کند. پولی را که بيمه‌گذار به بيمه‌گر می‌پردازد، حق بيمه و آنچه را که بيمه می‌شود، موضوع بيمه می‌نامند.",
    },
  ];
  const initialState = { categories: categories };
  const [state, dispatch] = useReducer(CategoryReducer, initialState);

  return (
    <CategoryContext.Provider
      value={{
        ...state,
        dispatch,
      }}
    >
      {children}
    </CategoryContext.Provider>
  );
};

export default CategoryState;
